Revit 2026 API

# FabricationConnectorInfo Class

---

Fabrication connector information.

SystemObject Autodesk.Revit.DBFabricationConnectorInfo

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FabricationConnectorInfo : IDisposable
```
```vb
Public Class FabricationConnectorInfo
	Implements IDisposable
```
```cpp
public ref class FabricationConnectorInfo : IDisposable
```
```fsharp
type FabricationConnectorInfo =
    class
        interface IDisposable
    end
```

The FabricationConnectorInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BodyConnectorId | Fabrication body connector Id. |
|  | DoubleWallConnectorId | Fabrication double wall connector Id. |
|  | FabricationIndex | The index of the connector shown within the fabrication software. |
|  | IsBodyConnectorLocked | Fabrication body connector lock. |
|  | IsDoubleWallConnectorLocked | Fabrication double wall connector lock. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FabricationConnectorInfo |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | HasDoubleWallConnector | Checks if there are any double wall connectors fabricated. |
|  | IsValid | Checks if the connector has fabrication parameters associated with it that can be set. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace